Revit 2027 API
BuiltInFailures.OpeningFailures.OpenStringerConflictNosing Property
 Open stringer can't be created for selected nosing profile. Set nosing profile to default to get open stringers created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenStringerConflictNosing { get; }
Public Shared ReadOnly Property OpenStringerConflictNosing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenStringerConflictNosing {
	FailureDefinitionId^ get ();
}
static member OpenStringerConflictNosing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace